[
    "Salma and Jennifer, her college best friend, were headed to downtown San Antonio on first Friday pub run. She re-routed a Lyft to make a stop at Paramour for a mutual friend’s birthday party. In the elevator going up to the rooftop....",
    "Jose had other plans that day, but his mom convinced him to go to her friend’s daughter’s birthday party at Paramour. In the elevator going up to the rooftop...",
    "They made eye contact for the first time!  His Dominican flow had her captivated immediately. By the end of the night, they had each other’s numbers ;)",
    "She has a wandering soul and he has a kindred spirit. They packed up their homes in Texas and embarked on a 19 month journey as digital nomads with their dog, Brodie.",
    "They spent the first months showing each other’s roots in her home country Mexico, and in his home country, the Dominican Republic. Then they lived in various cities in Colombia, Peru, Chile, Argentina, and Brazil, learning from the world together, and supporting each other through the rollercoaster of life abroad!",
    "Soon after celebrating one last horrah at Carnaval in Río de Janeiro, the pandemic brought them back to Texas during those months of uncertainty to be closer to their moms. After living out of Airbnbs for many many months, they decided to create a home of their own and moved to Austin, Texas with Brodie! This is the place they now call home.",
    "They were visiting Gogi's home country and traveled to the North of the island to Las Terrenas, his favorite place on Earth. At sunset, they set out for a romantic walk on the beach. To her surprise, she found a bottle in the sand with a hidden message inside. The message told a story of a local fishermen‘s tale. She was instructed by the tale to face the sun and make a wish with her eyes closed. At that moment, he knelt down in one knee and waited for her to turn around. Without a moment of doubt, she knew they were destined to spend the rest of their lives together!"
]